class Wikipedia:

    def __init__(self):
        self.dictionary = {"Історія":
                     {"Археологія": (" М. Брайчевський", " О. Коцієвський"),
                      "Нумізматика": (" Д. Фрейзер", " А. Бастіан"), },
                 "Політика":
                     {"Політична психологія": ("О. Майборода", "Филиппов А.В."),
                      "Політична соціологія": ("Бацевич Ф. С.", "Є.Захаров"), },
                 "Економіка":
                     {"Мікроекономіка": ("М. Фрідман", "А. Філіппенко"),
                      "Макроекономіка": ("Д. Любченко", "М. Фрідман"), },
                 "Традиції":
                     {"Українські": ("М. Левитський", "Ю. Юзич"),
                      "Військові": ("В. Куін", "Г. Шумським"), },
                 "Кінематографія":
                     {"Каскадери": ("Ю. Бріннер", "Д. Дар"),
                      "Кінооператори": ("Е. Лесні", "Луї Ле Пренс"), },
                 "Персоналії":
                     {"Зниклі": ("У. Абель", "Г. Лінгнер"),
                      "Довгожителі": ("Г. Бейнс", "Х. Тійоно"), },
                 "Література":
                     {"Поети": ("Л. Костенко", "О. Олесь"),
                      "Анти-утопія": ("Дж. Орвел", "Дж. Байрон"), },
                 "Міста":
                     {"Мегаполіси": ("Й. Матонго", "Д. Кроун"), },
                 "Міфологія":
                     {"Первісна": ("К. Рад", "М. Сіліліус"),
                      "Сучасна": ("Клод Леві-Строс", "Б. Лобовик"), },
                 "Мова":
                     {"Синхронія": ("Фердинанд де Сосюр", "Бодуен де Куртене"),
                      "Діахронія": ("Ян Бодуен де Куртене", "В. І. Даль"), },
                 }

    def _choice_of_category(self, dictionary):
        for category in dictionary:
            print("        ", category)

    def show_subchapters(self):
        self._choice_of_category(self.dictionary)
        self.chapter = str(input("Виберіть категорію: ").capitalize())
        self._choice_of_category(self.dictionary[self.chapter])

    def show_articles(self):
        self.subchapter = str(input('Виберіть підкатегорію: ').capitalize())
        for name in range(0, len(self.dictionary[self.chapter][self.subchapter])):
            print("{}".format(self.dictionary[self.chapter][self.subchapter][name]))


using_wiki = Wikipedia()
using_wiki.show_subchapters()
using_wiki.show_articles()
